Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.7.83/samg53/svd/ATSAMG53G19.svd
            <register>
               <name>LCCWR</name>
               <description>Last Channel Compare Window Register</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LOWTHRES</name>
                     <description>Low Threshold</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>HIGHTHRES</name>
                     <description>High Threshold</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVER</name>
               <description>Overrun Status Register</description>
               <addressOffset>0x3C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>OVRE0</name>
                     <description>Overrun Error 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE1</name>
                     <description>Overrun Error 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE2</name>
                     <description>Overrun Error 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE3</name>
                     <description>Overrun Error 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE4</name>
                     <description>Overrun Error 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE5</name>
                     <description>Overrun Error 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE6</name>
                     <description>Overrun Error 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE7</name>
                     <description>Overrun Error 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EMR</name>
               <description>Extended Mode Register</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CMPMODE</name>
                     <description>Comparison Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CMPMODESelect</name>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Generates an event when the converted data is lower than the low threshold of the window.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>Generates an event when the converted data is higher than the high threshold of the window.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IN</name>
                           <description>Generates an event when the converted data is in the comparison window.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OUT</name>
                           <description>Generates an event when the converted data is out of the comparison window.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMPTYPE</name>
                     <description>Comparison Type</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CMPTYPESelect</name>
                        <enumeratedValue>
                           <name>FLAG_ONLY</name>
                           <description>Any conversion is performed and comparison function drives the COMPE flag.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>START_CONDITION</name>
                           <description>Comparison conditions must be met to start the storage of all conversions until the CMPRST bit is set.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMPSEL</name>
                     <description>Comparison Selected Channel</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CMPALL</name>
                     <description>Compare All Channels</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMPFILTER</name>
                     <description>Compare Event Filtering</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSR</name>
                     <description>Over Sampling Rate</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>OSRSelect</name>
                        <enumeratedValue>
                           <name>NO_AVERAGE</name>
                           <description>No averaging. ADC sample rate is maximum.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSR4</name>
                           <description>1-bit enhanced resolution by averaging. ADC sample rate divided by 4.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSR16</name>
                           <description>2-bit enhanced resolution by averaging. ADC sample rate divided by 16.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ASTE</name>
                     <description>Averaging on Single Trigger Event</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ASTESelect</name>
                        <enumeratedValue>
                           <name>MULTI_TRIG_AVERAGE</name>
                           <description>The average requests several trigger events.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLE_TRIG_AVERAGE</name>
                           <description>The average requests only one trigger event.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRCCLK</name>
                     <description>External Clock Selection</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SRCCLKSelect</name>
                        <enumeratedValue>
                           <name>PERIPH_CLK</name>
                           <description>The peripheral clock is the source for the ADC prescaler.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PMC_PCK</name>
                           <description>PMC PCKx is the source clock for the ADC prescaler, thus the ADC clock can be independent of the core/peripheral clock.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TAG</name>
                     <description>Tag of the ADC_LCDR</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CWR</name>
               <description>Compare Window Register</description>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LOWTHRES</name>
                     <description>Low Threshold</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>HIGHTHRES</name>
                     <description>High Threshold</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>CDR[%s]</name>
               <description>Channel Data Register 0</description>
               <addressOffset>0x50</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>Converted Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPMR</name>
               <description>Write Protection Mode Register</description>
               <addressOffset>0xE4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0</description>
                           <value>0x414443</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPSR</name>
               <description>Write Protection Status Register</description>
               <addressOffset>0xE8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protection Violation Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVSRC</name>
                     <description>Write Protection Violation Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RPR</name>
               <description>Receive Pointer Register</description>
               <addressOffset>0x100</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RXPTR</name>
                     <description>Receive Pointer Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RCR</name>
               <description>Receive Counter Register</description>
               <addressOffset>0x104</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RXCTR</name>
                     <description>Receive Counter Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RNPR</name>
               <description>Receive Next Pointer Register</description>
               <addressOffset>0x110</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RXNPTR</name>
                     <description>Receive Next Pointer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RNCR</name>
               <description>Receive Next Counter Register</description>
               <addressOffset>0x114</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RXNCTR</name>
                     <description>Receive Next Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PTCR</name>
               <description>Transfer Control Register</description>
               <addressOffset>0x120</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RXTEN</name>
                     <description>Receiver Transfer Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXTDIS</name>
                     <description>Receiver Transfer Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXTEN</name>
                     <description>Transmitter Transfer Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXTDIS</name>
                     <description>Transmitter Transfer Disable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXCBEN</name>
                     <description>Receiver Circular Buffer Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXCBDIS</name>
                     <description>Receiver Circular Buffer Disable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXCBEN</name>
                     <description>Transmitter Circular Buffer Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXCBDIS</name>
                     <description>Transmitter Circular Buffer Disable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRCLR</name>
                     <description>Transfer Bus Error Clear</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PTSR</name>
               <description>Transfer Status Register</description>
               <addressOffset>0x124</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXTEN</name>
                     <description>Receiver Transfer Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXTEN</name>
                     <description>Transmitter Transfer Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXCBEN</name>
                     <description>Receiver Circular Buffer Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXCBEN</name>
                     <description>Transmitter Circular Buffer Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERR</name>
                     <description>Transfer Bus Error</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
