Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.7.83/samg53/svd/ATSAMG53G19.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>GPBR</name>
         <version>6378G</version>
         <description>General Purpose Backup Registers</description>
         <groupName>GPBR</groupName>
         <prependToName>GPBR_</prependToName>
         <baseAddress>0x400E1490</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x20</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>SYS_GPBR[%s]</name>
               <description>General Purpose Backup Register 0</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>GPBR_VALUE</name>
                     <description>Value of GPBR x</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>I2SC0</name>
         <version>11241E</version>
         <description>Inter-IC Sound Controller</description>
         <groupName>I2SC</groupName>
         <prependToName>I2SC_</prependToName>
         <baseAddress>0x40000000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x228</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>I2SC0</name>
            <value>16</value>
         </interrupt>
         <registers>
            <register>
               <name>CR</name>
               <description>Control Register</description>
               <addressOffset>0x00</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RXEN</name>
                     <description>Receiver Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXDIS</name>
                     <description>Receiver Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CKEN</name>
                     <description>Clocks Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CKDIS</name>
                     <description>Clocks Disable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEN</name>
                     <description>Transmitter Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXDIS</name>
                     <description>Transmitter Disable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MR</name>
               <description>Mode Register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MODE</name>
                     <description>Inter-IC Sound Controller Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MODESelect</name>
                        <enumeratedValue>
                           <name>SLAVE</name>
                           <description>I2SCK and i2SWS pin inputs used as bit clock and word select/frame synchronization.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MASTER</name>
                           <description>Bit clock and word select/frame synchronization generated by I2SC from MCK and output to I2SCK and I2SWS pins. MCK is output as master clock on I2SMCK if I2SC_MR.IMCKMODE is set.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DATALENGTH</name>
                     <description>Data Word Length</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>DATALENGTHSelect</name>
                        <enumeratedValue>
                           <name>_32_BITS</name>
                           <description>Data length is set to 32 bits</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_24_BITS</name>
                           <description>Data length is set to 24 bits</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_20_BITS</name>
                           <description>Data length is set to 20 bits</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_18_BITS</name>
                           <description>Data length is set to 18 bits</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16_BITS</name>
                           <description>Data length is set to 16 bits</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16_BITS_COMPACT</name>
                           <description>Data length is set to 16-bit compact stereo. Left sample in bits 15:0 and right sample in bits 31:16 of same word.</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_8_BITS</name>
                           <description>Data length is set to 8 bits</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_8_BITS_COMPACT</name>
                           <description>Data length is set to 8-bit compact stereo. Left sample in bits 7:0 and right sample in bits 15:8 of the same word.</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RXMONO</name>
                     <description>Receive Mono</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXDMA</name>
                     <description>Single or Multiple PDC Channels for Receiver</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXLOOP</name>
                     <description>Loop-back Test Mode</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXMONO</name>
                     <description>Transmit Mono</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXDMA</name>
                     <description>Single or Multiple PDC Channels for Transmitter</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXSAME</name>
                     <description>Transmit Data when Underrun</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IMCKDIV</name>
                     <description>Peripheral Clock to I2SC Master Clock Ratio</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>IMCKFS</name>
                     <description>Master Clock to fs Ratio</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                     <enumeratedValues>
                        <name>IMCKFSSelect</name>
                        <enumeratedValue>
                           <name>M2SF16</name>
                           <description>Sample frequency ratio set to 16</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>M2SF32</name>
                           <description>Sample frequency ratio set to 32</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>M2SF48</name>
                           <description>Sample frequency ratio set to 48</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>M2SF64</name>
                           <description>Sample frequency ratio set to 64</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>M2SF96</name>
                           <description>Sample frequency ratio set to 96</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>M2SF128</name>
                           <description>Sample frequency ratio set to 128</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>M2SF192</name>
                           <description>Sample frequency ratio set to 192</description>
                           <value>0xB</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>M2SF256</name>
                           <description>Sample frequency ratio set to 256</description>
                           <value>0xF</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>M2SF384</name>
                           <description>Sample frequency ratio set to 384</description>
                           <value>0x17</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>M2SF512</name>
                           <description>Sample frequency ratio set to 512</description>
                           <value>0x1F</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>M2SF768</name>
                           <description>Sample frequency ratio set to 768</description>
                           <value>0x2F</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>M2SF1024</name>
                           <description>Sample frequency ratio set to 1024</description>
                           <value>0x3F</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IMCKMODE</name>
                     <description>Master Clock Mode</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IWS</name>
                     <description>I2SWS TDM Slot Width</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <description>Status Register</description>
               <addressOffset>0x08</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXEN</name>
                     <description>Receiver Enabled</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXRDY</name>
                     <description>Receive Ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXOR</name>
                     <description>Receive Overrun</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENDRX</name>
                     <description>End of Receiver Transfer</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEN</name>
                     <description>Transmitter Enabled</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXRDY</name>
                     <description>Transmit Ready</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXUR</name>
                     <description>Transmit Underrun</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENDTX</name>
                     <description>End of Transmitter Transfer</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXORCH</name>
                     <description>Receive Overrun Channel</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>RXBUFF</name>
                     <description>Receive Buffer Full</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXURCH</name>
                     <description>Transmit Underrun Channel</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>TXBUFE</name>
                     <description>Transmit Buffer Empty</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCR</name>
               <description>Status Clear Register</description>
               <addressOffset>0x0C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RXOR</name>
                     <description>Receive Overrun Status Clear</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXUR</name>
                     <description>Transmit Underrun Status Clear</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXORCH</name>
                     <description>Receive Overrun Per Channel Status Clear</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>TXURCH</name>
                     <description>Transmit Underrun Per Channel Status Clear</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SSR</name>
               <description>Status Set Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RXOR</name>
                     <description>Receive Overrun Status Set</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXUR</name>
                     <description>Transmit Underrun Status Set</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXORCH</name>
                     <description>Receive Overrun Per Channel Status Set</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>TXURCH</name>
                     <description>Transmit Underrun Per Channel Status Set</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IER</name>
               <description>Interrupt Enable Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RXRDY</name>
                     <description>Receiver Ready Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXOR</name>
                     <description>Receiver Overrun Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENDRX</name>
                     <description>End of Reception Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXRDY</name>
                     <description>Transmit Ready Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXUR</name>
                     <description>Transmit Underflow Interrupt Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENDTX</name>
                     <description>End of Transmission Interrupt Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFULL</name>
                     <description>Receive Buffer Full Interrupt Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEMPTY</name>
                     <description>Transmit Buffer Empty Interrupt Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
