Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.7.83/samg53/svd/ATSAMG53G19.svd
            <register>
               <name>IMR</name>
               <description>Interrupt Mask Register</description>
               <addressOffset>0x006C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MOSCXTS</name>
                     <description>Main Crystal Oscillator Status Interrupt Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCKA</name>
                     <description>PLLA Lock Interrupt Mask</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCKRDY</name>
                     <description>Master Clock Ready Interrupt Mask</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCKRDY0</name>
                     <description>Programmable Clock Ready 0 Interrupt Mask</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCKRDY1</name>
                     <description>Programmable Clock Ready 1 Interrupt Mask</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCKRDY2</name>
                     <description>Programmable Clock Ready 2 Interrupt Mask</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MOSCSELS</name>
                     <description>Main Oscillator Selection Status Interrupt Mask</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MOSCRCS</name>
                     <description>Main On-Chip RC Status Interrupt Mask</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFDEV</name>
                     <description>Clock Failure Detector Event Interrupt Mask</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FSMR</name>
               <description>Fast Startup Mode Register</description>
               <addressOffset>0x0070</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FSTT0</name>
                     <description>Fast Startup Input Enable 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTT1</name>
                     <description>Fast Startup Input Enable 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTT2</name>
                     <description>Fast Startup Input Enable 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTT3</name>
                     <description>Fast Startup Input Enable 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTT4</name>
                     <description>Fast Startup Input Enable 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTT5</name>
                     <description>Fast Startup Input Enable 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTT6</name>
                     <description>Fast Startup Input Enable 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTT7</name>
                     <description>Fast Startup Input Enable 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTT8</name>
                     <description>Fast Startup Input Enable 8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTT9</name>
                     <description>Fast Startup Input Enable 9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTT10</name>
                     <description>Fast Startup Input Enable 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTT11</name>
                     <description>Fast Startup Input Enable 11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTT12</name>
                     <description>Fast Startup Input Enable 12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTT13</name>
                     <description>Fast Startup Input Enable 13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTT14</name>
                     <description>Fast Startup Input Enable 14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTT15</name>
                     <description>Fast Startup Input Enable 15</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTTAL</name>
                     <description>RTT Alarm Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTCAL</name>
                     <description>RTC Alarm Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPM</name>
                     <description>Low-power Mode</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLPM</name>
                     <description>Flash Low-power Mode</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>FLPMSelect</name>
                        <enumeratedValue>
                           <name>FLASH_STANDBY</name>
                           <description>Flash is in Standby Mode when system enters Wait Mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FLASH_DEEP_POWERDOWN</name>
                           <description>Flash is in Deep-power-down mode when system enters Wait Mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FLASH_IDLE</name>
                           <description>Idle mode</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FSPR</name>
               <description>Fast Startup Polarity Register</description>
               <addressOffset>0x0074</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FSTP0</name>
                     <description>Fast Startup Input Polarityx</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTP1</name>
                     <description>Fast Startup Input Polarityx</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTP2</name>
                     <description>Fast Startup Input Polarityx</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTP3</name>
                     <description>Fast Startup Input Polarityx</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTP4</name>
                     <description>Fast Startup Input Polarityx</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTP5</name>
                     <description>Fast Startup Input Polarityx</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTP6</name>
                     <description>Fast Startup Input Polarityx</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTP7</name>
                     <description>Fast Startup Input Polarityx</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTP8</name>
                     <description>Fast Startup Input Polarityx</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTP9</name>
                     <description>Fast Startup Input Polarityx</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTP10</name>
                     <description>Fast Startup Input Polarityx</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTP11</name>
                     <description>Fast Startup Input Polarityx</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTP12</name>
                     <description>Fast Startup Input Polarityx</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTP13</name>
                     <description>Fast Startup Input Polarityx</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTP14</name>
                     <description>Fast Startup Input Polarityx</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTP15</name>
                     <description>Fast Startup Input Polarityx</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FOCR</name>
               <description>Fault Output Clear Register</description>
               <addressOffset>0x0078</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>FOCLR</name>
                     <description>Fault Output Clear</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPMR</name>
               <description>Write Protection Mode Register</description>
               <addressOffset>0x00E4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.</description>
                           <value>0x504D43</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPSR</name>
               <description>Write Protection Status Register</description>
               <addressOffset>0x00E8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protection Violation Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVSRC</name>
                     <description>Write Protection Violation Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OCR</name>
               <description>Oscillator Calibration Register</description>
               <addressOffset>0x0110</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CAL8</name>
                     <description>RC Oscillator Calibration bits for 8 MHz</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SEL8</name>
                     <description>Selection of RC Oscillator Calibration bits for 8 MHz</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAL16</name>
                     <description>RC Oscillator Calibration bits for 16 MHz</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SEL16</name>
                     <description>Selection of RC Oscillator Calibration bits for 16 MHz</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAL24</name>
                     <description>RC Oscillator Calibration bits for 24 MHz</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SEL24</name>
                     <description>Selection of RC Oscillator Calibration bits for 24 MHz</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
