Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.7.83/samg53/svd/ATSAMG53G19.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>RTC</name>
         <version>6056S</version>
         <description>Real-time Clock</description>
         <groupName>RTC</groupName>
         <prependToName>RTC_</prependToName>
         <baseAddress>0x400E1460</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x30</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>RTC</name>
            <value>2</value>
         </interrupt>
         <registers>
            <register>
               <name>CR</name>
               <description>Control Register</description>
               <addressOffset>0x00</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>UPDTIM</name>
                     <description>Update Request Time Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UPDCAL</name>
                     <description>Update Request Calendar Register</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMEVSEL</name>
                     <description>Time Event Selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TIMEVSELSelect</name>
                        <enumeratedValue>
                           <name>MINUTE</name>
                           <description>Minute change</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HOUR</name>
                           <description>Hour change</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MIDNIGHT</name>
                           <description>Every day at midnight</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOON</name>
                           <description>Every day at noon</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CALEVSEL</name>
                     <description>Calendar Event Selection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CALEVSELSelect</name>
                        <enumeratedValue>
                           <name>WEEK</name>
                           <description>Week change (every Monday at time 00:00:00)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MONTH</name>
                           <description>Month change (every 01 of each month at time 00:00:00)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YEAR</name>
                           <description>Year change (every January 1 at time 00:00:00)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MR</name>
               <description>Mode Register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>HRMOD</name>
                     <description>12-/24-hour Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PERSIAN</name>
                     <description>PERSIAN Calendar</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NEGPPM</name>
                     <description>NEGative PPM Correction</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CORRECTION</name>
                     <description>Slow Clock Correction</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>HIGHPPM</name>
                     <description>HIGH PPM Correction</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OUT0</name>
                     <description>All ADC Channel Trigger Event Source Selection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>OUT0Select</name>
                        <enumeratedValue>
                           <name>NO_WAVE</name>
                           <description>No waveform, stuck at '0'</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FREQ1HZ</name>
                           <description>1 Hz square wave</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FREQ32HZ</name>
                           <description>32 Hz square wave</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FREQ64HZ</name>
                           <description>64 Hz square wave</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FREQ512HZ</name>
                           <description>512 Hz square wave</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALARM_FLAG</name>
                           <description>Output is a copy of the alarm flag</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OUT1</name>
                     <description>ADC Last Channel Trigger Event Source Selection</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>OUT1Select</name>
                        <enumeratedValue>
                           <name>NO_WAVE</name>
                           <description>No waveform, stuck at '0'</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FREQ1HZ</name>
                           <description>1 Hz square wave</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FREQ32HZ</name>
                           <description>32 Hz square wave</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FREQ64HZ</name>
                           <description>64 Hz square wave</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FREQ512HZ</name>
                           <description>512 Hz square wave</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALARM_FLAG</name>
                           <description>Output is a copy of the alarm flag</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMR</name>
               <description>Time Register</description>
               <addressOffset>0x08</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SEC</name>
                     <description>Current Second</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>MIN</name>
                     <description>Current Minute</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>HOUR</name>
                     <description>Current Hour</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>AMPM</name>
                     <description>Ante Meridiem Post Meridiem Indicator</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CALR</name>
               <description>Calendar Register</description>
               <addressOffset>0x0C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CENT</name>
                     <description>Current Century</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>YEAR</name>
                     <description>Current Year</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MONTH</name>
                     <description>Current Month</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DAY</name>
                     <description>Current Day in Current Week</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>DATE</name>
                     <description>Current Day in Current Month</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMALR</name>
               <description>Time Alarm Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SEC</name>
                     <description>Second Alarm</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SECEN</name>
                     <description>Second Alarm Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MIN</name>
                     <description>Minute Alarm</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>MINEN</name>
                     <description>Minute Alarm Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HOUR</name>
                     <description>Hour Alarm</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>AMPM</name>
                     <description>AM/PM Indicator</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HOUREN</name>
                     <description>Hour Alarm Enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CALALR</name>
               <description>Calendar Alarm Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MONTH</name>
                     <description>Month Alarm</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>MTHEN</name>
                     <description>Month Alarm Enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATE</name>
                     <description>Date Alarm</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>DATEEN</name>
                     <description>Date Alarm Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <description>Status Register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ACKUPD</name>
                     <description>Acknowledge for Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ACKUPDSelect</name>
                        <enumeratedValue>
                           <name>FREERUN</name>
                           <description>Time and calendar registers cannot be updated.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UPDATE</name>
                           <description>Time and calendar registers can be updated.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ALARM</name>
                     <description>Alarm Flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ALARMSelect</name>
                        <enumeratedValue>
                           <name>NO_ALARMEVENT</name>
                           <description>No alarm matching condition occurred.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALARMEVENT</name>
                           <description>An alarm matching condition has occurred.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SEC</name>
                     <description>Second Event</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SECSelect</name>
                        <enumeratedValue>
                           <name>NO_SECEVENT</name>
                           <description>No second event has occurred since the last clear.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SECEVENT</name>
                           <description>At least one second event has occurred since the last clear.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TIMEV</name>
                     <description>Time Event</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TIMEVSelect</name>
                        <enumeratedValue>
                           <name>NO_TIMEVENT</name>
                           <description>No time event has occurred since the last clear.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIMEVENT</name>
                           <description>At least one time event has occurred since the last clear.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CALEV</name>
                     <description>Calendar Event</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CALEVSelect</name>
                        <enumeratedValue>
                           <name>NO_CALEVENT</name>
                           <description>No calendar event has occurred since the last clear.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CALEVENT</name>
                           <description>At least one calendar event has occurred since the last clear.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TDERR</name>
                     <description>Time and/or Date Free Running Error</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TDERRSelect</name>
                        <enumeratedValue>
                           <name>CORRECT</name>
                           <description>The internal free running counters are carrying valid values since the last read of the Status Register (RTC_SR).</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERR_TIMEDATE</name>
                           <description>The internal free running counters have been corrupted (invalid date or time, non-BCD values) since the last read and/or they are still invalid.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCCR</name>
               <description>Status Clear Command Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>ACKCLR</name>
                     <description>Acknowledge Clear</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ALRCLR</name>
                     <description>Alarm Clear</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SECCLR</name>
                     <description>Second Clear</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMCLR</name>
                     <description>Time Clear</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CALCLR</name>
                     <description>Calendar Clear</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TDERRCLR</name>
                     <description>Time and/or Date Free Running Error Clear</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
